[
  {
    "title": "Bank Marketing Analytics Dashboard",
    "description": "This educational project involved building an interactive Bank Marketing Dashboard using Dash and data visualization techniques. The goal was to identify key factors influencing customer decisions about term deposit subscriptions by analyzing demographics, financial status, and past marketing interactions. While the advanced functionality was not the focus, the project highlights effective team collaboration and clear problem formulation.",
    "keywords": ["Dashboard", "Dash", "Testing", "Collaboration", "Virtual Environments", "GitHub"],
    "impact": "The dashboard helps marketing managers explore customer traits and optimize targeting strategies, aiming to improve conversion rates and reduce inefficient outreach. It served as a valuable exercise in practicing collaborative workflows for us and applying data-driven thinking in a real-world context.",
    "image": "/personal-website/img/project_banners/bank_analytics_dashboard_banner.png",
    "github": "https://github.com/UBC-MDS/DSCI-532_2025_12_bank-marketing",
    "date": "2025-03-17",
    "project_tag": "ubc",
    "project_tag_title": "University of British Columbia"
  },
  {
    "title": "Summarease Package",
    "description": "The main goal of the project was to collaboratively develop a lightweight Python package using tools like CookieCutter and fundamental data analysis techniques. Summarease is designed to provide quick insights into a dataset by summarizing its key features. It includes functions that help users understand data structure, enabling more efficient planning of data cleaning and exploratory data analysis (EDA). The project targets usability, with clear motivation and usage instructions to ensure users' easy interaction. To check code quality, the functions are tested using pytest, and code coverage metrics are used to track how thoroughly the code is tested. Continuous Integration and Continuous Deployment (CI/CD) practices were integrated into the development workflow to automatically test, version, and deploy the package. This ensures consistent quality, faster iteration, and reduces the risk of human error during updates and releases.",
    "keywords": ["CI/CD", "Package Development", "Full Documentation", "Virtual Environments", "Collaboration", "GitHub", "Testing", "Code Coverage"],
    "impact": "The project was developed primarily for educational purposes, with the focus on learning the development process rather than building advanced functionality. Still, Summarease can be used in the early stages of data analysis to automate the generation of dataset summaries, helping data scientists quickly understand the structure and quality of their data, accelerating tasks like cleaning and exploratory analysis.",
    "image": "/personal-website/img/project_banners/summarease_banner.png",
    "github": "https://github.com/UBC-MDS/airline-customer-satisfaction-predictor",
    "date": "2025-02-03",
    "project_tag": "ubc",
    "project_tag_title": "University of British Columbia"
  },
  {
    "title": "Airline Customer Satisfaction",
    "description": "The aim of the project is to use Git and GitHub for collaborative data analysis, ensuring smooth teamwork and version control. It focuses on managing software and environment dependencies using virtual environments and containers, while automating data science workflows and creating non-interactive scripts and analysis pipelines for efficient and reproducible work. Additionally, the project involves running literate coding documents non-interactively for streamlined documentation and analysis.",
    "keywords": ["Collaboration", "Docker", "GitHub", "Report", "Classification", "Full Documentation", "Scikit-Learn", "Virtual Environments", "Data Validation", "Testing"],
    "impact": "Developed a decision tree classification model to predict airline customer satisfaction based on service quality, seat comfort, and demographics. The model achieved a strong F1-score of 0.94 on the test set, effectively distinguishing between satisfied and dissatisfied customers.",
    "image": "/personal-website/img/project_banners/customer_satisfaction_banner.png",
    "github": "https://github.com/UBC-MDS/airline-customer-satisfaction-predictor",
    "date": "2024-12-16",
    "project_tag": "ubc",
    "project_tag_title": "University of British Columbia"
  },
  {
    "title": "Efficiently Fine-Tuning MusicGen For Text Conditioned Armenian Music Generation",
    "description": "Composing music has traditionally been an inherently human activity, deeply connected to creativity and emotional expression. With advancements in deep learning and generative models, automated music generation has become a practicable approach to exploring new creative possibilities. This research focuses on developing a generative AI model capable of producing Armenian music compositions. Given the high memory demands of running the full model on my limited laptop, the source code was optimized to improve both speed and memory efficiency. By fine-tuning the MusicGen model on a 62.8-hour corpus of Armenian music, the goal was to generate compositions that capture Armenia's cultural nuances while ensuring high musical quality and alignment with textual descriptions.",
    "keywords": ["Fine-Tuning", "Text-to-Music Generation", "Generative AI", "PyTorch", "Memory Optimization", "Full Documentation"],
    "impact": "We achieved significant improvements made to the MusicGen model for generating Armenian music. Through optimization of the training pipeline, we enhanced both the speed and memory efficiency, allowing for more effective utilization of resources. Human evaluators rated the generated compositions with an average score of 3.84 out of 5 for music quality and 3.96 out of 5 for relevance to the provided text conditions, indicating a substantial improvement over previous models in generating culturally resonant Armenian music. This work not only demonstrates the potential of AI in creative applications but also contributes to the preservation and innovation of Armenian cultural heritage, offering new possibilities for automated music generation.",
    "image": "/personal-website/img/project_banners/musicgen_banner.png",
    "github": "https://github.com/HrayrMuradyan/MusicGeneration",
    "date": "2024-05-16",
    "project_tag": "aua",
    "project_tag_title": "American University of Armenia"
  },
  {
    "title": "Age and Gender Prediction from Images",
    "description": "Facial recognition models for predicting age and gender from images have numerous applications in fields like security, healthcare, and age-restricted access control. I used the MTCNN library for face detection and fine-tuned the FairFace model, originally trained on ResNet34, to develop two neural networks for age and gender prediction. By analyzing the incorrect predictions, I was able to identify mislabeled data, which had unusually large errors. While gender can be more easily determined from facial features, predicting age is more complex and not as straightforward due to the variability in facial features across different age groups, the influence of factors such as genetics, lifestyle, and environmental conditions, and the challenge of distinguishing between specific age-related changes.",
    "keywords": ["Transfer Learning", "Fine-Tuning", "Computer Vision", "PyTorch", "Classification", "Regression", "Object Recognition"],
    "impact": "I achieved a 96% validation accuracy for gender prediction and a mean absolute error of 5.24 for age prediction, establishing a strong foundation for gender and age prediction systems.",
    "image": "/personal-website/img/project_banners/age_gender_banner.png",
    "github": "https://github.com/HrayrMuradyan/AgeGenderPrediction",
    "date": "2023-12-15",
    "project_tag": "aua",
    "project_tag_title": "American University of Armenia"
  },
  {
    "title": "Respiratory Sound Analysis",
    "description": "This project aims to classify respiratory sounds into clinical conditions using annotated audio recordings from patients across various age groups, captured in clinical settings with different devices. Accurate identification of these sounds is essential for the early diagnosis of respiratory disorders, supporting timely and effective medical intervention. By using detailed annotations and recordings from diverse environments, the goal is to develop a robust model capable of generalizing across different patient profiles and recording scenarios.",
    "keywords": ["Fourier Transformation", "Sound Data", "Classification", "Time Series Analysis", "PyTorch", "Scikit-Learn"],
    "impact": "The model achieved 84% accuracy on the validation set using features extracted through Fourier transformation, despite the challenges posed by the imbalance of the dataset. This result demonstrates machine learning models' potential and provides a strong starting point for developing more advanced respiratory sound classification systems.",
    "image": "/personal-website/img/project_banners/respiratory_sound_banner.png",
    "github": "https://github.com/HrayrMuradyan/RespiratorySoundAnalysis",
    "date": "2023-11-12",
    "project_tag": "aua",
    "project_tag_title": "American University of Armenia"
  },
  {
    "title": "Sports Image Classification",
    "description": "This project focuses on classifying sports images into 100 different categories using Keras and transfer learning. It begins with a baseline model, followed by a regularized version, and ends with a transfer learning model that delivers promising results. Each model is thoroughly documented, including architecture, performance metrics, observations, and suggestions for future improvements. The project demonstrates a strong understanding of the advantages and limitations of each approach, highlighting how transfer learning can significantly enhance performance in image classification tasks when having limited data.",
    "keywords": ["Transfer Learning", "Computer Vision", "Classification", "Tensorflow", "Regularization"],
    "impact": "Achieved 97% accuracy on the validation set, demonstrating strong performance on a balanced dataset with a relatively small number of observations. This high accuracy highlights the model's potential for real-world applications and sets a good foundation for sports image classification tasks.",
    "image": "/personal-website/img/project_banners/sports_classification_banner.png",
    "github": "https://github.com/HrayrMuradyan/SportImageClassification/tree/main",
    "date": "2022-06-22",
    "project_tag": "personal",
    "project_tag_title": "Personal Project"
  }
]
